In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data/202301_.csv',encoding='euc-kr')
df.drop(columns=['등록일자'],inplace=True)
df.head()

       사용일자  노선명     역명  승차총승객수  하차총승객수
0  20230101  경강선    곤지암    1450    1539
1  20230101  2호선    신도림   20210   21037
2  20230101  2호선     문래    5995    6567
3  20230101  2호선  영등포구청    5629    6117
4  20230101  2호선     당산    6821    7594

In [8]:
cols = list(df.columns)[:3]
target = list(df.columns)[3:]
df_list = []
# 반복문에 해당되지 않는 범위는 수동으로 구해서 
for i in range(2, 28, 7): # 사용할때 여기 수정 해당 월에 맞게   여긴 1월2일이 월요일이라 2일 부터 시작 30,31일 데이터는 추가로 더해야함
    start_date = 20230100 + i   # 여기도 조건에 맞게 수정
    end_date = start_date + 5
    df_temp = df[(df['사용일자'] >= start_date) & (df['사용일자'] < end_date)].copy()
    df_temp = df_temp.groupby(cols)[target].agg('sum').reset_index()
    df_list.append(df_temp)
df_1 = pd.concat(df_list, axis=0)
df_1['사용일자'] = 202301
df_1 = df_1.groupby(cols)[target].agg('sum').reset_index()

In [9]:
df_1.head()

     사용일자  노선명   역명  승차총승객수  하차총승객수
0  202301  1호선  동대문  207530  192758
1  202301  1호선  동묘앞  148384  154602
2  202301  1호선  서울역  999971  939973
3  202301  1호선   시청  492216  501666
4  202301  1호선  신설동  263018  255042

In [10]:
df_1.shape

(612, 5)

In [ ]:
# 이렇게 12개월치 구한거
# df_res_list = [df_1,df_2,df_3 ....df_12] 리스트 안에 넣음
# df_res = pd.concat(df_res_list, axis=0) 합침
# 이거에 이제 역명 '(' 지우고 하는 작업하고
# 호선별로 나눈다음에
# line_merge 코드 짜둔거 사용해서 합치면 됨